#Дана строка текста. Подсчитать количество букв «т» в строке.

s = input('Введите строку: ')
res = s.count('т')
print(res)