#2. Выведите на экран для числа 2 его степени от 0 до 20
#Решить задачу используя циклическую конструкцию while.

i = 0
while i <= 20:
    print(2**i)
    i += 1