#Дана строка, содержащая русскоязычный текст. Найти количество слов, начинающихся с буквы "е".
s = input('Введите строку ')
c = s.count(' е')
print(c)
