#Дана строка-предложение на английском языке.
# Преобразовать строку так, чтобы каждое слово начиналось с заглавной буквы.
s = input('Введите строку \n')
c = s.title()
print(c)