#Дана строка текста. Подсчитать количество букв «т» в строке.
s = input('Введите строку \n')
c = s.count('т')
print(c)