#Дана строка, заканчивающаяся точкой. Подсчитать, сколько слов в строке.
s = input('Введите строку \n')
c = s.count(' ')
d = c + 1
print(f'Слов в строке {d}')
