#Определить, сколько раз в тексте встречается заданное слово.
s = input('Введите строку \n')
c = input('ведите слово \n')
d = s.count(c)
print(d)